Revit 2026 API

# RevolutionAxis Property

---

Returns the Axis of the Revolution.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelLine Axis { get; }
```
```vb
Public ReadOnly Property Axis As ModelLine
	Get
```
```cpp
public:
property ModelLine^ Axis {
	ModelLine^ get ();
}
```
```fsharp
member Axis : ModelLine with get
```

#### Property Value

ModelLine

This property is used to retrieve the Axis of the Revolution.

#### Reference

Revolution Class

Autodesk.Revit.DB Namespace